[{"id": 1, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features a modern design with an open floor plan, gourmet kitchen, and a luxurious master suite. Enjoy the spacious backyard with a patio perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant, family-friendly neighborhood known for its excellent schools and parks. Residents enjoy a variety of local shops, restaurants, and recreational activities. The community hosts regular events such as farmers' markets and outdoor movie nights, fostering a strong sense of belonging among its residents."}, {"id": 2, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a gourmet kitchen with stainless steel appliances, and a beautiful backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. The neighborhood boasts numerous parks, walking trails, and local shops, making it ideal for outdoor enthusiasts and families alike. Enjoy weekend farmers' markets, community events, and easy access to major highways for convenient commuting."}, {"id": 3, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "2", "size": "1,200 sqft", "description": "This charming two-bedroom condo features an open floor plan, modern kitchen appliances, and a balcony with stunning views. Perfect for first-time buyers or investors.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its sunny weather and friendly atmosphere. With a variety of parks, top-rated schools, and local shops, it offers a perfect blend of city life and suburban quiet. Enjoy weekend farmers' markets, community events, and proximity to excellent dining options. It's an ideal place for families and young professionals alike."}, {"id": 4, "neighborhood": "Sunnyvale", "price": "$525,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "This charming two-bedroom condo features an open-concept living area, a modern kitchen with stainless steel appliances, and a private balcony perfect for morning coffee.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood filled with an eclectic mix of shops, cafes, and parks. Residents enjoy a welcoming community atmosphere, with seasonal farmers' markets and outdoor movie nights in the park. With top-rated schools and easy access to major highways and public transit, Sunnyvale is perfect for families and commuters alike."}, {"id": 5, "neighborhood": "Maplewood", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open-concept layout, modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Maplewood is a vibrant and family-friendly neighborhood known for its tree-lined streets, award-winning schools, and community parks. Residents enjoy a rich array of local shops, cafes, and art galleries. With its strong sense of community and numerous family-oriented events throughout the year, Maplewood is a wonderful place to call home."}, {"id": 6, "neighborhood": "Sunnyvale", "price": "$750,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a gourmet kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining. The master suite offers a luxurious en-suite bathroom and ample closet space.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy nearby parks, shopping centers, and a variety of restaurants. With a strong sense of community, Sunnyvale hosts seasonal festivals and farmers' markets, making it a great place for families and young professionals alike."}, {"id": 7, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, a chef's kitchen with modern appliances, and a beautiful backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. Residents enjoy access to numerous parks, local farmers' markets, and a variety of dining options. The neighborhood hosts regular community events, making it a great place to connect with neighbors. With convenient access to major highways and public transit, commuting to nearby tech hubs is a breeze."}, {"id": 8, "neighborhood": "Sunnyvale Heights", "price": "$950,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This beautifully updated four-bedroom home features an open-concept living area, a gourmet kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its family-friendly atmosphere and excellent schools. Residents enjoy a variety of local parks, farmers' markets, and recreational activities. The neighborhood is conveniently located near shopping centers and offers easy access to major highways, making it a great place for both relaxation and commuting."}, {"id": 9, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "Beautifully designed four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a backyard oasis perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its excellent schools and family-friendly atmosphere. Residents enjoy a variety of parks, recreational facilities, and local boutiques. The community hosts regular farmers' markets and outdoor events, creating a lively social scene. Convenient access to major highways and public transport makes commuting to nearby cities easy and efficient."}, {"id": 10, "neighborhood": "Lakeside Meadows", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "3,200 sqft", "description": "An exquisite four-bedroom home featuring a modern open floor plan, gourmet kitchen, and a beautifully landscaped backyard with a pool. Ideal for entertaining and family gatherings.", "neighborhood_description": "Lakeside Meadows is a tranquil community nestled by a picturesque lake, perfect for outdoor enthusiasts. The neighborhood boasts scenic walking trails, playgrounds, and a vibrant farmers' market every weekend. Residents enjoy easy access to top-rated schools and a variety of dining options, making it a perfect blend of suburban charm and modern convenience."}, {"id": 11, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "2", "size": "1,100 sqft", "description": "Charming two-bedroom condo featuring modern finishes, an open floor plan, and a private balcony with scenic views.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its sunny weather and friendly atmosphere. Residents enjoy a variety of local shops, cafes, and parks. The community hosts weekly farmers' markets and seasonal festivals, making it a lively place to live. With convenient access to public transport, commuting to the city is easy."}, {"id": 12, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home boasts modern finishes, an open-concept layout, and a large backyard perfect for entertaining. The gourmet kitchen features stainless steel appliances and a spacious island. Enjoy cozy evenings in the beautifully designed living room with a fireplace.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its tree-lined streets and friendly atmosphere. Residents enjoy numerous parks, top-rated schools, and a variety of shopping and dining options. The neighborhood hosts seasonal farmers' markets and community events, making it a great place for families and young professionals alike."}, {"id": 13, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open floor plan, modern kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining. The master suite includes a luxurious ensuite bathroom.", "neighborhood_description": "Sunnyvale Heights is an upscale neighborhood known for its beautiful views and family-friendly atmosphere. With top-rated schools, beautiful parks, and vibrant shopping areas, residents enjoy a variety of local amenities. The community hosts regular events, allowing neighbors to connect and enjoy the picturesque surroundings."}, {"id": 14, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Nestled in the heart of Sunnyvale, this stunning four-bedroom home features a modern open floor plan, gourmet kitchen, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its excellent schools, parks, and family-friendly atmosphere. Residents enjoy a variety of local dining options, weekend farmers markets, and community events. With easy access to tech hubs and major highways, it's an ideal location for professionals and families alike."}, {"id": 15, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard, perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. The neighborhood boasts lush parks, farmer’s markets, and a variety of dining options ranging from casual cafes to fine dining. With a strong sense of community, residents often partake in local events and festivals throughout the year."}, {"id": 16, "neighborhood": "Sunnyvale", "price": "$950,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, a gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, beautiful parks, and diverse dining options. Residents enjoy a family-friendly atmosphere with plenty of recreational activities, including hiking trails, sports facilities, and seasonal farmers' markets. The neighborhood is conveniently located near shopping centers and has easy access to major highways for commuters."}, {"id": 17, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard, perfect for entertaining or relaxing.", "neighborhood_description": "Sunnyvale is a vibrant community known for its sunny weather and friendly atmosphere. Residents enjoy a variety of local parks, farmers' markets, and a thriving arts scene. The neighborhood is home to top-rated schools and is conveniently located near shopping centers, restaurants, and recreational facilities, making it an ideal place for families and professionals alike."}, {"id": 18, "neighborhood": "Willow Creek", "price": "$450,000", "bedrooms": "4", "bathrooms": "3", "size": "2,400 sqft", "description": "This charming four-bedroom home features an open-concept layout, a modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Willow Creek is a family-friendly neighborhood known for its excellent schools, beautiful parks, and a variety of local shops. Residents enjoy a strong sense of community with regular events and activities, including farmers' markets and seasonal festivals. The scenic Willow Creek Park offers walking trails and playgrounds, making it a great spot for families and outdoor enthusiasts alike."}, {"id": 19, "neighborhood": "Maplewood", "price": "$550,000", "bedrooms": "4", "bathrooms": "3", "size": "2,400 sqft", "description": "This charming four-bedroom home features an open concept layout with a modern kitchen, a cozy fireplace in the living room, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Maplewood is a vibrant neighborhood known for its friendly atmosphere and family-oriented community. With an array of parks, local shops, and excellent schools, it’s ideal for families. Enjoy weekend farmers' markets and seasonal festivals in the town square, all while being conveniently located near major highways for easy commutes."}, {"id": 20, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "Stunning four-bedroom home featuring an open-concept design with a gourmet kitchen, large living area, and a private backyard oasis perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its picturesque views and family-friendly atmosphere. Residents enjoy easy access to top-rated schools, lush parks, and local farmers' markets. The neighborhood is well-connected with walking trails and public transportation, making it easy to explore the nearby downtown area with its eclectic mix of shops and restaurants."}, {"id": 21, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom bungalow with a bright open layout, featuring a modern kitchen, updated bathroom, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its friendly community and sunny weather. Residents enjoy a number of parks, local farmers' markets, and cafes with outdoor seating. The area is well-connected by public transit, making it easy to explore nearby attractions and the bustling downtown area."}, {"id": 22, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard ideal for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its sunny weather and family-friendly atmosphere. The community is filled with parks, top-rated schools, and a variety of dining options. Residents enjoy weekend farmers' markets and seasonal festivals at the local community center, making it a great place to socialize and connect with neighbors."}, {"id": 23, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept design with a modern kitchen, spacious living area, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its excellent schools, parks, and friendly atmosphere. Residents enjoy a variety of local shops, dining options, and recreational activities. The Sunnyvale Community Center offers classes and events year-round, while the nearby Sunnyvale Park provides ample green space for outdoor activities. With easy access to major highways and public transit, commuting to Silicon Valley tech hubs is quick and convenient."}, {"id": 24, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "An elegant four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy a variety of local parks, family-friendly events, and a bustling farmers market every weekend. The neighborhood is conveniently located near shopping centers, dining options, and offers quick access to major highways for commuting."}, {"id": 25, "neighborhood": "Sunnyvale", "price": "$675,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This spacious four-bedroom home features an open floor plan, modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, family-friendly parks, and a variety of recreational activities. Enjoy weekend farmers' markets, local art shows, and a diverse array of restaurants. With its close proximity to major highways and public transit options, Sunnyvale offers both convenience and a welcoming atmosphere."}, {"id": 26, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "A beautiful four-bedroom home featuring modern finishes, an open-concept kitchen, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy local parks, walking trails, and an array of dining options. The neighborhood hosts seasonal farmers' markets and community events, making it an ideal place for families and young professionals alike. With easy access to major highways, commuting to nearby cities is convenient."}, {"id": 27, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning modern home featuring an open floor plan, gourmet kitchen with high-end appliances, and a serene backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its excellent schools, beautiful parks, and family-friendly atmosphere. With a variety of local shops, restaurants, and cafes, there's always something to explore. Residents enjoy easy access to community events, farmers' markets, and recreational facilities, making it a great place for families and active individuals alike."}, {"id": 28, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "2", "size": "1,250 sqft", "description": "A charming two-bedroom condo featuring modern finishes, an open floor plan, and a private balcony with stunning views.", "neighborhood_description": "Sunnyvale is a vibrant urban neighborhood known for its sunny weather and friendly community. Residents enjoy a variety of parks, trendy cafes, and boutique shops. With excellent schools and a strong sense of community, it's the perfect place for families and young professionals alike. The neighborhood also boasts convenient access to public transportation and major highways."}, {"id": 29, "neighborhood": "Sunset Valley", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3.5", "size": "3,200 sqft", "description": "This stunning four-bedroom home features an open floor plan, a modern kitchen with stainless steel appliances, and a luxurious master suite with a private balcony overlooking the valley.", "neighborhood_description": "Sunset Valley is known for its breathtaking views and tranquil atmosphere. The community offers beautiful hiking trails, top-rated schools, and a variety of local shops and restaurants. Residents enjoy weekend farmers' markets and seasonal festivals, fostering a vibrant community spirit."}, {"id": 30, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, a gourmet kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent schools. With numerous parks, walking trails, and local events throughout the year, residents enjoy an active lifestyle. The neighborhood also boasts a variety of dining options, shops, and quick access to major highways for easy commuting."}, {"id": 31, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "2", "size": "1,250 sqft", "description": "A charming two-bedroom condo featuring an open floor plan, modern kitchen with stainless steel appliances, and a private balcony overlooking the garden.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its friendly atmosphere and beautiful parks. Residents enjoy a variety of dining options, local shops, and community events throughout the year. The area boasts excellent schools, making it a great place for families. A network of walking and biking trails makes it easy to explore the natural beauty of the surroundings."}, {"id": 32, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring an open-concept living area, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its sunny weather and family-friendly atmosphere. Residents enjoy a diverse array of parks, shopping centers, and dining options. With excellent schools and a variety of recreational activities, Sunnyvale is the perfect place for families and professionals alike. The community hosts several annual events, including a summer fair and a farmers' market, fostering a strong sense of connection among neighbors."}, {"id": 33, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout with a modern kitchen, a large backyard, and a spacious master suite with an ensuite bathroom.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and family-oriented amenities. Residents enjoy lush parks, top-rated schools, and a variety of shopping and dining options. The neighborhood hosts regular farmers' markets, community events, and has excellent public transit access, making it a favorite among commuters."}, {"id": 34, "neighborhood": "Sunny Meadows", "price": "$625,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living space with modern finishes, a gourmet kitchen with stainless steel appliances, and a lush backyard perfect for entertaining.", "neighborhood_description": "Sunny Meadows is a vibrant community known for its friendly atmosphere and beautiful parks. With top-rated schools, family-friendly activities, and a variety of dining options, it's an ideal place for families. The bustling Sunny Meadows Square offers boutiques and cafes, while nearby walking trails provide ample opportunities for outdoor adventures."}, {"id": 35, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features modern amenities, an open-concept floor plan, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, parks, and family-friendly atmosphere. Enjoy weekends at local farmers' markets, or take the kids to the nearby Sunnyvale Community Park. With a variety of dining options and recreational activities, residents love the blend of suburban charm and urban convenience."}, {"id": 36, "neighborhood": "Maplewood", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "3,500 sqft", "description": "Stunning four-bedroom home featuring an open-concept living space, gourmet kitchen, and a beautifully landscaped backyard with a spacious patio perfect for entertaining.", "neighborhood_description": "Maplewood is a vibrant community known for its tree-lined streets and friendly atmosphere. Residents enjoy easy access to top-rated schools, parks, and a variety of boutique shops and restaurants. The annual Maplewood Arts Festival brings together artists and families for a day of creativity and fun. With excellent public transport options, commuting to the city is quick and convenient."}, {"id": 37, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent school districts. Residents enjoy easy access to parks, shopping centers, and a variety of dining options. The area hosts regular community events, fostering a strong sense of belonging, and is conveniently located near major highways for quick commutes."}, {"id": 38, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open-concept layout, a gourmet kitchen with stainless steel appliances, and a luxurious master suite with a private balcony. The backyard is perfect for entertaining with a spacious patio and landscaped garden.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its excellent schools, parks, and community events. Residents enjoy easy access to an array of dining options, shopping centers, and recreational facilities. The local Sunnyvale Park offers playgrounds and walking trails, while the weekly farmers' market showcases fresh produce from local vendors."}, {"id": 39, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, parks, and family-friendly atmosphere. Residents enjoy a variety of local shops, restaurants, and outdoor activities, including hiking trails and playgrounds. The neighborhood hosts regular farmers' markets and community events, fostering a warm and welcoming environment."}, {"id": 40, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining. The master suite includes a walk-in closet and a luxurious en-suite bathroom.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its family-friendly atmosphere and excellent schools. The neighborhood offers a variety of parks, walking trails, and recreational facilities. Residents can enjoy local farmers markets, boutique shops, and a diverse selection of restaurants. With a strong sense of community, Sunnyvale Heights is an ideal place to call home."}, {"id": 41, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, parks, and family-friendly ambiance. Residents enjoy a mix of urban conveniences and suburban tranquility, with plenty of dining options, shopping centers, and recreational facilities. The annual Sunnyvale Festival brings locals together to celebrate art, food, and music, making it a great place to call home."}, {"id": 42, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "A stunning four-bedroom home featuring an open-concept layout, modern appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its excellent schools and friendly atmosphere. Residents enjoy a variety of local parks, shopping centers, and dining options. The community hosts seasonal events, including farmers' markets and outdoor movie nights. With convenient access to major highways and public transit, commuting to the nearby tech hubs is quick and easy."}, {"id": 43, "neighborhood": "Sunnyvale", "price": "$450,000", "bedrooms": "2", "bathrooms": "1", "size": "1,100 sqft", "description": "Charming two-bedroom condo featuring an open floor plan, modern kitchen, and a private balcony with stunning views.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its friendly atmosphere and family-oriented activities. It boasts excellent schools, numerous parks, and a thriving local market. Residents enjoy easy access to shopping, dining, and recreational facilities, making it a fantastic place for families and young professionals alike."}, {"id": 44, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "3,200 sqft", "description": "An exquisite four-bedroom home featuring an open floor plan, gourmet kitchen, and a stunning backyard oasis perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its picturesque views and family-friendly atmosphere. The area boasts top-rated schools, lush parks, and a variety of local shops and eateries. Residents enjoy weekend farmers' markets and community events, fostering a strong sense of community. Convenient access to major highways and public transit makes commuting easy and seamless."}, {"id": 45, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "A stunning four-bedroom home featuring an open-concept living and dining area, a modern kitchen with stainless steel appliances, and a private backyard oasis perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its excellent schools and beautiful parks. Residents enjoy a variety of local shops, restaurants, and recreational activities. The community hosts seasonal festivals and farmers' markets, making it a lively place to call home. With great accessibility to major highways and public transit, commuting to the city is quick and convenient."}, {"id": 46, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring an open-concept layout, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. With plenty of parks, shopping centers, and recreational facilities, residents enjoy an active lifestyle. The neighborhood is also home to the popular Sunnyvale Farmers Market, which showcases local produce and artisanal goods every Saturday."}, {"id": 47, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,400 sqft", "description": "This charming four-bedroom home features an open concept layout, a modern kitchen with stainless steel appliances, and a beautiful backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent schools. Residents enjoy a variety of parks, shopping centers, and dining options. The local farmers' market is a favorite spot for fresh produce, and the annual community festival brings everyone together for fun and festivities. With its convenient location and warm community spirit, Sunnyvale is an ideal place to call home."}, {"id": 48, "neighborhood": "Sunnyvale", "price": "$450,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "A charming two-bedroom apartment featuring an open-concept living area, modern kitchen appliances, and a private balcony with stunning views.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly community known for its parks, excellent schools, and diverse dining options. Residents enjoy easy access to the Sunnyvale Farmers Market on weekends and a variety of recreational activities in nearby Sunnyvale Park. With convenient public transport options and a welcoming atmosphere, it's an ideal place for families and young professionals alike."}, {"id": 49, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, a gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. With plenty of parks, recreational activities, and a variety of dining options, residents enjoy a high quality of life. The neighborhood hosts monthly farmers' markets and seasonal festivals, making it a great place to live for families and young professionals alike."}, {"id": 50, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout with a modern kitchen, spacious living areas, and a beautifully landscaped backyard, perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its sunny weather and friendly atmosphere. Residents enjoy a variety of parks, local farmers' markets, and a bustling downtown area filled with shops and eateries. The local schools are highly rated, making it a great place for families. With excellent access to major highways and public transit, commuting to nearby cities is convenient and efficient."}, {"id": 51, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, gourmet kitchen with stainless steel appliances, and a luxurious master suite. The landscaped backyard is perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is known for its vibrant community and picturesque views. With tree-lined streets and friendly neighbors, this family-oriented area offers top-rated schools, parks, and a variety of local shops and restaurants. Enjoy weekend farmers' markets and community events that bring residents together, fostering a friendly atmosphere."}, {"id": 52, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its great schools and friendly atmosphere. With plenty of parks, playgrounds, and local shops, residents enjoy a suburban lifestyle with easy access to urban amenities. The weekly farmers' market and annual community festival bring everyone together, making it an ideal place for families and young professionals alike."}, {"id": 53, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, a modern kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent schools. The neighborhood boasts numerous parks, recreational facilities, and shopping centers. Residents enjoy a variety of dining options, including local cafes and popular restaurants, as well as a lively farmers' market every Saturday. With convenient access to major highways and public transit, Sunnyvale offers the perfect blend of suburban tranquility and urban convenience."}, {"id": 54, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout with a modern kitchen, a large backyard perfect for entertaining, and a luxurious master suite with a spa-like bathroom.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly parks. Enjoy a variety of local restaurants, boutique shops, and outdoor activities, including hiking trails and sports facilities. The neighborhood hosts regular farmers' markets and community events, creating a warm and welcoming atmosphere for residents."}, {"id": 55, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "Stunning four-bedroom home featuring a modern open floor plan, gourmet kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant neighborhood known for its tree-lined streets and friendly atmosphere. Residents enjoy proximity to top-rated schools, parks, and a variety of dining options. The local farmers' market every Saturday is a favorite among families, and the community hosts seasonal events that create a strong sense of belonging. With easy access to highways, commuting to the city is convenient."}, {"id": 56, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "A stunning four-bedroom home featuring an open floor plan, a modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. Residents enjoy nearby parks, shops, and restaurants, along with a strong sense of community. With various outdoor activities available, including hiking and biking trails, Sunnyvale is ideal for those who appreciate an active lifestyle."}, {"id": 57, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This charming four-bedroom home features a modern open-concept layout, a large backyard perfect for entertaining, and a cozy fireplace in the living room.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. The neighborhood boasts numerous parks, walking trails, and playgrounds. Residents enjoy a variety of dining options, from casual eateries to upscale restaurants, along with local farmers' markets and annual community events that foster a strong sense of belonging."}, {"id": 58, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This beautiful four-bedroom home features an open-concept layout, modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its excellent schools and parks. Residents enjoy a variety of local shops, restaurants, and recreational activities. The community hosts seasonal events such as farmers' markets and outdoor movie nights, making it a great place to raise a family."}, {"id": 59, "neighborhood": "Sunnyvale", "price": "$575,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom condo with modern amenities, featuring an open-plan living area and a private balcony overlooking lush greenery.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its sunny weather and friendly atmosphere. Residents enjoy a mix of parks, cafes, and local shops, making it a perfect place for families and young professionals. The renowned Sunnyvale Community Center offers various recreational activities, while the nearby Sunnyvale Farmers Market showcases fresh produce every weekend."}, {"id": 60, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom condo featuring an open floor plan, modern kitchen with stainless steel appliances, and a private balcony with stunning views.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent schools. The neighborhood boasts an array of parks, shopping centers, and dining options. Residents enjoy the convenience of nearby public transportation and feel secure in the welcoming, community-oriented environment."}, {"id": 61, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "Beautifully designed four-bedroom home featuring an open-concept layout, modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a family-friendly neighborhood known for its excellent schools, parks, and community events. Enjoy weekend farmers' markets, local artisan shops, and an array of dining options. The community is vibrant and welcoming, with plenty of recreational activities, including hiking trails and sports facilities."}, {"id": 62, "neighborhood": "Sunnydale", "price": "$525,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This gorgeous four-bedroom home features an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnydale is a vibrant community known for its friendly atmosphere and family-oriented amenities. Residents enjoy access to excellent schools, parks, and recreational facilities. The neighborhood hosts annual events such as a summer fair and farmers' market, making it easy to connect with neighbors. Conveniently located near shopping centers and public transport, Sunnydale is the ideal place for families and professionals alike."}, {"id": 63, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, modern kitchen with stainless steel appliances, and a serene backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. The neighborhood boasts lush parks, recreational facilities, and a variety of dining options, from casual eateries to fine dining. With a strong sense of community and numerous local events throughout the year, Sunnyvale is the perfect place to call home."}, {"id": 64, "neighborhood": "Sunnyvale", "price": "$450,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom condo featuring a modern kitchen, a bright living area, and a private balcony with scenic views.", "neighborhood_description": "Sunnyvale is a vibrant community known for its sunny weather and family-friendly atmosphere. Enjoy a variety of parks, recreational facilities, and local eateries. The neighborhood hosts a weekly farmers' market and is just minutes away from top-rated schools and shopping centers, making it an ideal place for families and young professionals alike."}, {"id": 65, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept layout, modern kitchen with stainless steel appliances, and a beautiful backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. With numerous parks, playgrounds, and recreational facilities, it's an ideal place for outdoor enthusiasts. Local shops, restaurants, and a weekly farmers market add to the neighborhood's charm, making it a convenient and enjoyable place to live."}, {"id": 66, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan with a gourmet kitchen, luxurious master suite, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant, family-friendly neighborhood known for its excellent schools, lush parks, and friendly atmosphere. Residents enjoy a variety of local shops, restaurants, and community events throughout the year. With convenient access to major highways and public transport, commuting to nearby cities is quick and easy."}, {"id": 67, "neighborhood": "Lakeside View", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "Stunning lakeside property featuring four spacious bedrooms, an open-concept living area, and a modern kitchen with high-end appliances. Enjoy breathtaking views from the large deck that overlooks the lake.", "neighborhood_description": "Lakeside View is a serene neighborhood known for its picturesque scenery and vibrant community life. Residents enjoy access to beautiful walking trails, water sports, and local farmers' markets. With top-rated schools and friendly neighbors, it's the perfect place for families and outdoor enthusiasts."}, {"id": 68, "neighborhood": "Sunnydale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open floor plan, modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnydale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy numerous parks, trendy cafes, and local shops. The neighborhood is well-connected with public transportation options and offers various recreational activities, making it a perfect place for families and young professionals alike."}, {"id": 69, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom, three-bathroom home features an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools, parks, and family-friendly atmosphere. The neighborhood boasts a variety of amenities including local shops, restaurants, and recreational facilities. Residents enjoy easy access to the Sunnyvale Park and the annual community fair, fostering a strong sense of belonging among neighbors."}, {"id": 70, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, an updated kitchen with stainless steel appliances, and a luxurious master suite with a walk-in closet. The backyard is perfect for entertaining, complete with a patio and landscaped garden.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its picturesque views and family-friendly atmosphere. Residents enjoy a variety of local parks, excellent schools, and easy access to shopping and dining options. With annual community events and a strong sense of camaraderie, Sunnyvale Heights is a great place to call home."}, {"id": 71, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, a gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its family-friendly atmosphere and excellent school system. Residents enjoy a variety of parks, recreational facilities, and nearby shopping centers. With an array of dining options and local events throughout the year, Sunnyvale offers a lively and engaging lifestyle for all ages."}, {"id": 72, "neighborhood": "Maplewood", "price": "$625,000", "bedrooms": "4", "bathrooms": "3", "size": "2,400 sqft", "description": "This stunning four-bedroom home features an open floor plan, a modern kitchen with granite countertops, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Maplewood is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy lush parks, local farmers' markets, and a variety of dining options from casual cafes to gourmet restaurants. The neighborhood is well-connected with public transit and offers a strong sense of community, making it an ideal place for families and young professionals alike."}, {"id": 73, "neighborhood": "Maplewood", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "3,200 sqft", "description": "Luxurious four-bedroom home featuring a modern open floor plan, gourmet kitchen, and a beautiful backyard oasis with a swimming pool.", "neighborhood_description": "Maplewood is an upscale neighborhood known for its tree-lined streets, top-rated schools, and vibrant community atmosphere. Residents enjoy access to boutique shops, fine dining, and numerous parks. The community hosts seasonal festivals and events, fostering a strong sense of belonging among its residents. With convenient access to major highways and public transport, getting around the city is effortless."}, {"id": 74, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "This charming two-bedroom condo features an open floor plan, modern kitchen with stainless steel appliances, and a private balcony perfect for morning coffee.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its beautiful parks, excellent schools, and a variety of dining options. Residents enjoy the annual Sunnyvale Festival, which showcases local artists and food vendors. With convenient access to major highways and public transport, commuting to work or exploring the surrounding areas is effortless."}, {"id": 75, "neighborhood": "Sunnyvale", "price": "$1,050,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring a modern open floor plan, gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. With numerous parks, walking trails, and recreational facilities, there’s always something to do. Residents enjoy a thriving local arts scene, a variety of restaurants and cafes, and easy access to tech hubs and major highways."}, {"id": 76, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,400 sqft", "description": "Stunning four-bedroom home featuring an open-concept layout, gourmet kitchen, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. With plenty of parks, walking trails, and local shops, residents enjoy a small-town feel while being just a short drive away from the bustling city. The neighborhood hosts various seasonal events, bringing neighbors together in celebration."}, {"id": 77, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,600 sqft", "description": "A stunning four-bedroom home featuring an open floor plan, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and family-friendly atmosphere. Enjoy weekend farmers' markets, local parks, and a variety of dining options. The neighborhood is conveniently located near major highways and public transit, making it easy to commute to nearby cities."}, {"id": 78, "neighborhood": "Maple Ridge", "price": "$525,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "A charming four-bedroom home featuring an open-concept living area, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Maple Ridge is a family-friendly neighborhood known for its top-rated schools, beautiful parks, and vibrant community events. Residents enjoy the local farmers market every Sunday and the annual Maple Fest in the spring. Conveniently located near shopping centers and major highways, it's an ideal spot for families and commuters alike."}, {"id": 79, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom condo featuring a modern kitchen, open living space, and a private balcony with stunning views.", "neighborhood_description": "Sunnyvale is a vibrant community known for its sunny weather and friendly atmosphere. Residents can enjoy nearby parks, trendy cafes, and a variety of shopping options. The neighborhood hosts a weekly farmers market, fostering a sense of community while providing fresh produce. Excellent schools and accessible public transit make Sunnyvale an ideal place for families and young professionals alike."}, {"id": 80, "neighborhood": "Maplewood", "price": "$525,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This charming four-bedroom home features an open floor plan, a large backyard perfect for entertaining, and modern finishes throughout. The spacious master suite includes a walk-in closet and en-suite bath.", "neighborhood_description": "Maplewood is a serene and family-friendly neighborhood known for its tree-lined streets and excellent schools. Residents enjoy easy access to local parks, playgrounds, and a variety of dining options. With a vibrant community center offering recreational activities, Maplewood is perfect for families looking for a safe and engaging environment."}, {"id": 81, "neighborhood": "Sunnyvale Heights", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, gourmet kitchen, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its friendly atmosphere and beautiful parks. Residents enjoy the convenience of nearby shopping centers, top-rated schools, and an array of dining options. With excellent walking trails and recreational facilities, this neighborhood is ideal for families and outdoor enthusiasts alike."}, {"id": 82, "neighborhood": "Sunnyvale", "price": "$550,000", "bedrooms": "2", "bathrooms": "1", "size": "1,200 sqft", "description": "Charming two-bedroom condo featuring an open floor plan, updated kitchen with stainless steel appliances, and a private balcony perfect for morning coffee.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its sunny weather and welcoming community. Residents enjoy a variety of local shops, cafes, and parks. The area hosts seasonal farmers' markets and outdoor movie nights, making it a great place for families and young professionals alike. With convenient access to major highways and public transportation, commuting to nearby Silicon Valley tech hubs is a breeze."}, {"id": 83, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "A beautiful four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a large backyard perfect for family gatherings.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its parks, top-rated schools, and community events. Residents enjoy easy access to shopping, dining, and recreational activities, with a variety of local festivals held throughout the year. The neighborhood is also home to several playgrounds and walking trails, making it ideal for families and outdoor enthusiasts."}, {"id": 84, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Stunning four-bedroom home featuring an open-concept layout, modern kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy numerous parks, hiking trails, and a lively downtown area filled with shops and restaurants. With a focus on family-friendly activities and community events, it's a great place to call home."}, {"id": 85, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open-concept floor plan, a modern kitchen with stainless steel appliances, and a luxurious master suite with a walk-in closet. Enjoy outdoor living in the beautifully landscaped backyard complete with a deck and garden.", "neighborhood_description": "Sunnyvale Heights is known for its vibrant community atmosphere, excellent schools, and easy access to parks and recreational facilities. Enjoy weekend farmers' markets, local boutiques, and a variety of dining options. The area offers scenic views and beautiful walking trails, making it a perfect location for families and outdoor enthusiasts alike."}, {"id": 86, "neighborhood": "Sunny Meadows", "price": "$450,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open floor plan, a modern kitchen with stainless steel appliances, and a landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunny Meadows is a vibrant community known for its friendly atmosphere and excellent local schools. Enjoy weekend farmers' markets, numerous parks with playgrounds, and family-friendly events throughout the year. The neighborhood also boasts convenient access to shopping centers and major highways, making it easy to get around."}, {"id": 87, "neighborhood": "Maplewood Heights", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "3,500 sqft", "description": "An exquisite four-bedroom home featuring a modern kitchen with stainless steel appliances, a spacious living area with a fireplace, and a beautiful backyard perfect for entertaining.", "neighborhood_description": "Maplewood Heights is a vibrant community known for its tree-lined streets and friendly atmosphere. Residents enjoy top-rated schools, local parks, and a variety of dining options. The Maplewood Farmers Market is a popular weekend destination, offering fresh produce and artisanal goods. With easy access to major highways, commuting to downtown is quick and convenient."}, {"id": 88, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "An exquisite four-bedroom home featuring an open floor plan, modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy a variety of local parks, walking trails, and family-friendly events throughout the year. The neighborhood boasts a range of dining options, from casual cafes to fine dining, plus convenient access to shopping and major highways for easy commuting."}, {"id": 89, "neighborhood": "Sunnyvale Heights", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features a modern open floor plan, gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant neighborhood known for its family-friendly atmosphere, top-rated schools, and community events. With easy access to parks, shopping districts, and hiking trails, residents enjoy an active lifestyle. The local farmers' market brings fresh produce weekly, and numerous cafes and restaurants offer diverse culinary experiences."}, {"id": 90, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open floor plan, a modern kitchen with stainless steel appliances, and a lovely backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its excellent schools and parks. With a variety of shopping and dining options, residents enjoy both convenience and a family-friendly atmosphere. The neighborhood is also home to several tech companies, making it an ideal location for professionals. Local attractions include the Sunnyvale Farmers Market and Baylands Park, which offers extensive trails and picnic areas."}, {"id": 91, "neighborhood": "Sunnyvale", "price": "$600,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant neighborhood known for its family-friendly atmosphere and excellent schools. With numerous parks, playgrounds, and community centers, this area offers plenty of outdoor activities. Enjoy local dining options, boutique shops, and farmers' markets that give the community a unique charm. The convenient access to major highways and public transport makes commuting to nearby cities effortless."}, {"id": 92, "neighborhood": "Sunnyvale Heights", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features a modern open-concept layout, a gourmet kitchen with granite countertops, and a large backyard perfect for entertaining. The spacious master suite includes a luxurious en-suite bathroom.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its tree-lined streets and family-friendly atmosphere. Residents enjoy access to top-rated schools, numerous parks, and a variety of local shops and restaurants. The neighborhood hosts seasonal festivals and farmers' markets, bringing the community together for fun and connection."}, {"id": 93, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Beautiful four-bedroom home featuring an open concept living area, modern kitchen with stainless steel appliances, and a spacious backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent school district. Residents enjoy a variety of parks, shopping centers, and local eateries. With family-oriented events throughout the year and nearby hiking trails, there's always something to do. The neighborhood's focus on community helps ensure a safe and welcoming environment for families."}, {"id": 94, "neighborhood": "Sunnyvale Heights", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "Beautifully designed four-bedroom home featuring an expansive open floor plan, gourmet kitchen with stainless steel appliances, and a luxurious master suite with a private balcony.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its picturesque views and family-friendly parks. The area boasts an array of amenities including top-rated schools, delightful cafes, and boutique shops. Enjoy weekend activities at the nearby Sunnyvale Park or explore the local farmer's market for fresh produce. With a strong sense of community and easy access to major highways, this neighborhood is perfect for families and professionals alike."}, {"id": 95, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open floor plan with a modern kitchen, a large backyard perfect for entertaining, and a cozy fireplace in the living room.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its excellent schools and parks. The area boasts a variety of local shops, restaurants, and recreational facilities. Residents enjoy easy access to hiking trails and the beautiful Sunnyvale Lake, making it an ideal place for outdoor enthusiasts and families alike."}, {"id": 96, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living space, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. Residents enjoy numerous parks, recreational facilities, and a variety of dining and shopping options downtown. The neighborhood is easily accessible via major highways and public transport, making it an ideal location for families and professionals alike."}, {"id": 97, "neighborhood": "Sunnyvale", "price": "$650,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-plan layout, a modern kitchen with stainless steel appliances, and a large backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its top-rated schools and parks. Residents enjoy a variety of local shops, restaurants, and community events throughout the year. With its tree-lined streets and recreational facilities, Sunnyvale offers a great quality of life just minutes away from downtown."}, {"id": 98, "neighborhood": "Sunnyvale Heights", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open-concept layout, gourmet kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale Heights is a vibrant community known for its family-friendly atmosphere and excellent schools. Residents enjoy access to lush parks, trendy restaurants, and a variety of recreational activities. With a strong sense of community and regular neighborhood events, Sunnyvale Heights is perfect for families looking to settle down."}, {"id": 99, "neighborhood": "Sunnyvale", "price": "$1,250,000", "bedrooms": "4", "bathrooms": "3", "size": "2,800 sqft", "description": "This stunning four-bedroom home features an open floor plan with a modern kitchen, expansive living spaces, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant community known for its friendly atmosphere and excellent schools. With plenty of parks, shopping areas, and diverse dining options, residents enjoy a high quality of life. The neighborhood is conveniently located near major highways, making commuting to nearby tech hubs hassle-free."}, {"id": 100, "neighborhood": "Sunnyvale", "price": "$1,200,000", "bedrooms": "4", "bathrooms": "3", "size": "2,500 sqft", "description": "This stunning four-bedroom home features an open-concept living area, a modern kitchen with stainless steel appliances, and a beautifully landscaped backyard perfect for entertaining.", "neighborhood_description": "Sunnyvale is a vibrant and family-friendly neighborhood known for its excellent schools and welcoming atmosphere. Residents enjoy easy access to numerous parks, recreational facilities, and local shops. The community holds regular events such as farmers' markets and outdoor movie nights in the park, making it an ideal place for families and young professionals alike."}]